Autodesk.Revit.DB.LocationPoint.Rotation
The angle of rotation around the insertion point, in radians.
Remarks: For view-based elements, the rotation angle is in the plane of the associated view.  For model elements,
the rotation angle is measured relative to the default coordinate system.  This property is not supported for
some elements supporting LocationPoints, such as AssemblyInstances, Groups, ModelText, Room, and SpotDimensions.
The rotation property is not supported for the Element
related to this LocationPoint.

Autodesk.Revit.DB.LocationPoint.Point
The physical location of the element.
Remarks: Setting this property is not supported for
some elements supporting LocationPoints, such as SpotDimensions.
Setting this property is not supported for the Element
related to this LocationPoint.

Autodesk.Revit.DB.LocationPoint
Provides location functionality for all elements that have a single insertion point.
Remarks: The location point objects adds additional functionality to its base location object
class. This includes setting the elements location to a specific point and retrieving its
rotation around its insertion point. Inplace families do not have a single insertion point and therefore do not have meaningful LocationPoint data.